app/controllers/offers_controller.rb

SELECT "offers".* FROM "offers"
---
  def index
    @offers = Offer.all

INSERT INTO "offers" ("created_at", "description", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-05-17 07:05:50.410745"], ["description", "sacsdcdscadscads"], ["title", "asdcadsads"], ["updated_at", "2014-05-17 07:05:50.410745"], ["user_id", 2]]
---
  def create
    @offer = Offer.new(offer_params)

    respond_to do |format|
      if @offer.save

SELECT  "offers".* FROM "offers"  WHERE "offers"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_offer
      @offer = Offer.find(params[:id])