app/controllers/requests_controller.rb

  def create
    @request = Request.new(request_params)

    respond_to do |format|
      if @request.save
---
INSERT INTO "requests" ("created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-05-17 06:59:10.095707"], ["title", "cqecreqc"], ["updated_at", "2014-05-17 06:59:10.095707"], ["user_id", 2]]